# **Pandas Practice ðŸ’ª**
## for lab4

1- import pandas

In [250]:
import pandas as pd

2- creat series like below

In [251]:
data = pd.Series(['city', 'ignis', '800', 'Verna','Venue','Punto'])
data

0     city
1    ignis
2      800
3    Verna
4    Venue
5    Punto
dtype: object

In [252]:
data_1 = pd.Series(['Honda', 'maruti', 'Maruti', 'Hyundia','Hyundai','Fiat'])
data_1

0      Honda
1     maruti
2     Maruti
3    Hyundia
4    Hyundai
5       Fiat
dtype: object

In [253]:
s = pd.Series([0,0,0,0,0,0])
type(s)

pandas.core.series.Series

In [254]:
s=s + [900000,600000,100000,800000,950000,750000]
s

0    900000
1    600000
2    100000
3    800000
4    950000
5    750000
dtype: int64

In [255]:
b = pd.Series([5,7,10,4,2,6])
b

0     5
1     7
2    10
3     4
4     2
5     6
dtype: int64

3- creating Data Ftrame frome your series like below

In [256]:
car_data = pd.DataFrame({"car": data, 
                         "brand": data_1,
                            "cost":s,
                       "year":b})
car_data

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

4-select column

In [257]:
car_data['brand']

0      Honda
1     maruti
2     Maruti
3    Hyundia
4    Hyundai
5       Fiat
Name: brand, dtype: object

5- select two columns

In [258]:
car_data[['car','cost']]

     car    cost
0   city  900000
1  ignis  600000
2    800  100000
3  Verna  800000
4  Venue  950000
5  Punto  750000

In [259]:
car_data_1 = pd.DataFrame({"car": data, 
                            "cost":s})
car_data_1

     car    cost
0   city  900000
1  ignis  600000
2    800  100000
3  Verna  800000
4  Venue  950000
5  Punto  750000

6- return dataframe to value

In [260]:
car_data.values

array([['city', 'Honda', 900000, 5],
       ['ignis', 'maruti', 600000, 7],
       ['800', 'Maruti', 100000, 10],
       ['Verna', 'Hyundia', 800000, 4],
       ['Venue', 'Hyundai', 950000, 2],
       ['Punto', 'Fiat', 750000, 6]], dtype=object)

7- Selecting Elements use iloc or loc

In [261]:
car_data_df=car_data.loc[1:2,['cost','year']]
car_data_df

     cost  year
1  600000     7
2  100000    10

8- sort data by cost from high cost to low cost

In [262]:
car_data_sort=car_data.sort_values(by='cost',ascending=False)
car_data_sort

     car    brand    cost  year
4  Venue  Hyundai  950000     2
0   city    Honda  900000     5
3  Verna  Hyundia  800000     4
5  Punto     Fiat  750000     6
1  ignis   maruti  600000     7
2    800   Maruti  100000    10

9- replace name of car 800 to toyota

In [263]:
car_data.loc[car_data['car'] == '800', 'car'] = 'toyota'
car_data

      car    brand    cost  year
0    city    Honda  900000     5
1   ignis   maruti  600000     7
2  toyota   Maruti  100000    10
3   Verna  Hyundia  800000     4
4   Venue  Hyundai  950000     2
5   Punto     Fiat  750000     6

10 - adding bool column has name "less 700" to know who is car cost less than 700000

In [264]:
car_data['less 700'] = car_data['cost'] > 700000
car_data

      car    brand    cost  year  less 700
0    city    Honda  900000     5      True
1   ignis   maruti  600000     7     False
2  toyota   Maruti  100000    10     False
3   Verna  Hyundia  800000     4      True
4   Venue  Hyundai  950000     2      True
5   Punto     Fiat  750000     6      True

11-drop year cloumn

In [265]:
car_data_drop= car_data.drop(columns=['year'])
car_data_drop

      car    brand    cost  less 700
0    city    Honda  900000      True
1   ignis   maruti  600000     False
2  toyota   Maruti  100000     False
3   Verna  Hyundia  800000      True
4   Venue  Hyundai  950000      True
5   Punto     Fiat  750000      True

12- insert new column has name "new year" after column "brand"

In [266]:
car_data.insert(2, "new year", [5, 7, "NaN",7,5,"NaN"])
car_data

      car    brand new year    cost  year  less 700
0    city    Honda        5  900000     5      True
1   ignis   maruti        7  600000     7     False
2  toyota   Maruti      NaN  100000    10     False
3   Verna  Hyundia        7  800000     4      True
4   Venue  Hyundai        5  950000     2      True
5   Punto     Fiat      NaN  750000     6      True

13- using groupby to grouping year and use sum function to add cost for similarities

In [278]:
#car_data.loc[car_data['year'] == 5,7
car_data.loc[car_data['new year'] == 5, 'year'] = 7
result = car_data.groupby('new year')['cost'].sum()
#result.index.name = 'new year'
result

new year
5      1850000
7      1400000
NaN     850000
Name: cost, dtype: int64